import React from "react";
import Header from "../../components/Header/Header";
import Footer from "../../components/Footer/Footer";
import Accordion from "../../components/Accordion/Accordion";
import ChatButton from "../../components/ChatPopup/ChatButton";
import ChatPopup from "../../components/ChatPopup/ChatPopup";
import styles from "./GuardiansInstructionsPage.module.css";

export default function GuardiansInstructionsPage() {
  return (
    <div className={styles.outer_container}>
      <ChatButton />
      <ChatPopup />
      <Header className={styles.header} />
      <main className={styles.main}>
        <h1>Οδηγίες για τους κηδεμόνες</h1>
        <div className={styles.accordionContainer}>
        <Accordion title="Εισαγωγή στην εφαρμογή" content={'Για την εγγραφή σας στην εφαρμογή, μεταβείτε στην καρτέλα Κηδεμόνας. Εάν έχετε ήδη κάποιον λογαριασμό κηδεμόνα, Σύνδεση, ενώ αν θέλετε να δημιουργήσετε λογαριασμό πατήστε Εγγραφή. \n\n Θα οδηγηθείτε στις κατάλληλες σελίδες, όπου καλέστε είτε να συμπληρώσετε τα στοιχεία του λογαριασμού σας,.είτε να συμπληρώσετε μερικά στοιχεία ώστε να γίνει η δημιουργία του λογαρισμού'} />
        <Accordion title="Πλοήγηση προφίλ" content={'Με την ολοκλήρωση της εγγραφής ή της σύνδεσης στην εφαρμογή, θα βρεθείτε στο προφίλ σας. Τα προσωπικά σας στοιχεία αναγράφονται στην αριστερή μεριά της σελίδας ενώ στο κέντρο και στα δεξιά καταγράφονται στοιχεία αναφορικά με τις συνεργασίες σας με επιμελητές. Εικόνα \n\n Δεξία από την εικόνα προφίλ σας μπορείτε να δείτε την τρέχουσα συνεργασία και δεξιά αυτής βρίσκονται οι πληρωμές επιμελητών.\n\n Κάτω από την τρέχουσα συνεργασία βρίσκεται οι δηλώσεις αιτημάτων συνεργασίας που έχεται αποθηκεύσει προσωρινά, ενώ δεξιά αυτού βρίσκονται οι οριστικοποιημένες δηλώσεις αιτιμάτων συνεργασίας με επιμελητές. Κάτω από τις προσωρινές αποθηκεύσεις βρίσκεται το ιστορικό των παλαιότερων συνεργασιών σας, καθώς και οι βαθμολογίες που αποδόσατε στον εκάστωτε επιμελητή.'} />
        <Accordion title="Αναζήτηση Επιμελιτή" content={'Στο κάτω μέρος της σελίδας του προφίλ βρίσκεται το κομπί “Αναζήτηση Επιμελητών ”.  Πατώντας το θα μεταβείτε σε μια σελίδα όπου φαίντονται συνοπτικά τα προφίλ πολλαπλών επιμελητών καθώς και φίλτρα τα οποία μπορείτε να χρησιμοποιήσετε για να βρείτε έναν επιμελητή που ανταποκρίνεται στις ανάγκες σας.\n\n Όταν βρείτε κάποιον επιμελητή που θεωρείτε κατάλληλο, κανεντε κλίκ στην καρτέλα του και μεταβαίνετε στο βιογραφικό του, όπου μπορείτε να δείτε ορισμένα προσωπικά του στοιχεία, αξιολογήσεις άλλων κηδεμόνων που έχουν συνεργαστεί μαζί του, καθώς και τις ώρες και τις μέρες που επιθυμεί να εργάζεται. Έχετε επίσης την δυνατότητα να συνομιλήσετε μαζί του μέσω μηνυμάτων, πατώντας το κουμπί “Στείλτε μήνυμα”, με σκοπό να προγραμματίσετε ένα ραντεβού και να τον/την γνωρίσετε από κοντά πριν ξεκινήσετε να συνεργάζεστε.'} />
        <Accordion title="Αίτημα συνεργασίας" content={'‘Αν μετά το ραντεβού σας με τον εκάστωτε επιμελητή/τρια αποφασίσετε ότι είναι κατάλληλος/λη για την φύλλαξη του παιδίου σας, τότε από την σελίδα του βιογραφικού του μπορείτε να  πατήσετε το κομπί “Αίτηση συνεργασίας”. Από εκεί μπορείτε να επιλέξετε τις ώρες και τις μέρες που επιθυμείτε να εργάζεται, ο επιμελητής και να  ορίσετε με βάση αυτές ποιό θα είναι το ωρομίσθιό του. Από εκεί μπορείτε αμά θέλετε να αποθηκεύσετε προσωρινά την δήλωση   ή να προχωρίσετε σε οριστική υποβολή οπου αποδέχεστε τους όρους του συμφωνιτικού και υποβάλετε την αίτηση σας, αναμένωντας πλέον την απόφαση της νταντάς.'} />

</div>
      </main>
      <Footer className={styles.footer} />
    </div>
  );
}