import React from "react";
import Header from "../../components/Header/Header";
import Footer from "../../components/Footer/Footer";
import Accordion from "../../components/Accordion/Accordion";
import styles from "./CaretakersPage.module.css";

export default function CaretakersPage() {
  return (
    <div className={styles.outer_container}>
      <Header className={styles.header} />
      <main className={styles.main}>
        <h1>Οδηγίες για τους επιμελητές</h1>
        <div className={styles.accordionContainer}>
          <Accordion title="Εισαγωγή στην Εφαρμογή" content={' Για την εγγραφή σας στην εφαρμογή, μεταβείτε στην καρτέλα `Επιμελητής`. \n\n Εικόνα \n\n Εάν έχετε ήδη κάποιον λογαριασμό επιμελητή, εισάγετε τα απαραίτητα στοιχεία στα πεδία της φόρμας σύνδεσης επιμελητών. \n\n Εικόνα \n\n Σε περίπτωση που δεν παρέχετε κάποιον ήδη υπάρχον λογαριασμό, μεταβείτε στη σελίδα εγγραφής είτε ακολουθώντας τον σύνδεσμο στο κάτω μέρος της φόρμας, είτε από την επιλογή στο επάνω δεξιό μέρος στης σελίδας  και ακολουθείστε την διαδικασία εγγραφής.'} />
          <Accordion title="Κριτήρια Επιλεξιμότητας" content={'Δικαίωμα εγγραφής στην εφαρμογή έχουν τα άτομα που: \n\n Α) έχουν συμπληρώσει το 18ο έτος της ηλικίας τους, \n\n Β) είναι Έλληνες ή αλλοδαποί πολίτες που διαμένουν νόμιμα στην Ελλάδα και έχουν πρόσβαση στην αγορά εργασίας '} />
          <Accordion title="Πλοήγηση Προφίλ" content= {' Με την ολοκλήρωση της εγγραφής ή της σύνδεσης στην εφαρμογή, θα βρεθείτε στην κεντρική σελίδα του προφίλ σας. Τα προσωπικά σας στοιχεία αναγράφονται στην αριστερή μεριά της σελίδας ενώ στο κέντρο και στα δεξιά καταγράφονται οι ώρες που έχετε επιλέξει να εργάζεστε, καθώς και στοιχεία αναφορικά με τις συνεργασίες σας με κηδεμόνες.\n\n Εικόνα \n\n Δεξία από την εικόνα προφίλ σας και κάτω από τον πίνακα με τις ώρες, μπορείτε να δείτε την τρέχουσα συνεργασία και δεξιά αυτής βρίσκονται οι πληρωμές σας από κηδεμόνες. \n\n Εικόνα \n\n Κάτω απο τον πίνακα αυτό θα βρείτε δύο υποκατηγορίες αναφορικά με καποια πιθανή τρέχουσα ενεργή συνεργασία, στα δεξιά και στα αριστερά στοιχεια αναφορικά με τις πληρωμές από κηδεμόνες. \n\n Εικόνα \n\n Πιο κάτω θα βρείτε δύο ακόμα υποκατηγορίες μια σχετικά με τις προηγούμενες συνεργασιές στα δεξιά, και μια σχετικά με τα αιτήματα εργασίας. \n\n Εικόνα '} />
          <Accordion title="Αποδοχή Συνεργασίας" content= {'Όταν ο κηδεμόνας προβεί σε αίτηση συνεργασίας, τότε στο πεδίο των αιτημάτων συνεργασιας δίπλα στο αίτημα του εκάσθοτε κηδεμόνα θα αναγραφετε `εκκρεμεί αποδοχή`, με πορτοκαλί χρώμα. \n\n Εικόνα \n\n Επιλέγοντας, αυτό θα γίνετε μεταφορά στο συμφωνητικό συνεργασίας, στο οποίο και θα αναγράφονται όλες οι λεπτομέριες συνεργασίας. \n\n Εικόνα \n\n Τέλος, θα πρέπει να συμπλήρωθουν τα πεδία, ‘Αποδοχή Συμφωνιτικού’ και ‘Αποδοχή Συνεργασίας’, εφοσον υπάρχει συναινεση αναφορικά με την συνεργασία, ενώ σε κάθε αλλη περιπτωση θα πρέπει να επιλεγεί η ‘Απόρριψη Συνεργασίας’. \n\n Εικόνα'}/>
        </div>
      </main>
      <Footer className={styles.footer} />
    </div>
  );
}