import React from "react";
import Header from "../../components/Header/Header";
import Footer from "../../components/Footer/Footer";
import Breadcrumbs from "../../components/Breadcrumb/Breadcrumb";
import Accordion from "../../components/Accordion/Accordion";
import ChatButton from "../../components/ChatPopup/ChatButton";
import ChatPopup from "../../components/ChatPopup/ChatPopup";
import styles from "./CaretakersPage.module.css";

export default function CaretakersPage() {
  return (
    <div className={styles.outer_container}>
      <ChatButton />
      <ChatPopup />
      <Header className={styles.header} />
      <Breadcrumbs className={styles.breadcrumbs} />
      <main className={styles.main}>
        <h1>Οδηγίες για τους επιμελητές</h1>
        <div className={styles.accordionContainer}>
        <Accordion title="Εισαγωγή στην εφαρμογή" 
content={'Για την εγγραφή σας στην εφαρμογή, μεταβείτε στην καρτέλα Επιμελητής. Εάν έχετε ήδη κάποιον λογαριασμό κηδεμόνα, Σύνδεση, ενώ αν θέλετε να δημιουργήσετε λογαριασμό πατήστε Εγγραφή. Θα οδηγηθείτε στις κατάλληλες σελίδες,  όπου καλέστε είτε να συμπληρώσετε τα στοιχεία του λογαριασμού σας,.είτε να συμπληρώσετε μερικά στοιχεία ώστε να γίνει η δημιουργία του λογαρισμού '} />
          <Accordion title="Πλοήγηση Προφίλ" content= {' Με την ολοκλήρωση της εγγραφής ή της σύνδεσης στην εφαρμογή, θα βρεθείτε στην κεντρική σελίδα του προφίλ σας. Τα προσωπικά σας στοιχεία αναγράφονται στην αριστερή μεριά της σελίδας ενώ στο κέντρο και στα δεξιά καταγράφονται οι ώρες που έχετε επιλέξει να εργάζεστε, καθώς και στοιχεία αναφορικά με τις συνεργασίες σας με κηδεμόνες.\n\n Δεξία από την εικόνα προφίλ σας και κάτω από τον πίνακα με τις ώρες, μπορείτε να δείτε την τρέχουσα συνεργασία και δεξιά αυτής βρίσκονται οι πληρωμές σας από κηδεμόνες. \n\n Κάτω απο τον πίνακα αυτό θα βρείτε δύο υποκατηγορίες αναφορικά με καποια πιθανή τρέχουσα ενεργή συνεργασία, στα δεξιά και στα αριστερά στοιχεια αναφορικά με τις πληρωμές από κηδεμόνες.\n Πιο κάτω θα βρείτε δύο ακόμα υποκατηγορίες μια σχετικά με τις προηγούμενες συνεργασιές στα δεξιά, και μια σχετικά με τα αιτήματα εργασίας. '} />
          <Accordion title="Αποδοχή Συνεργασίας" content= {'Όταν ο κηδεμόνας προβεί σε αίτηση συνεργασίας, τότε στο πεδίο των αιτημάτων συνεργασιας δίπλα στο αίτημα του εκάσθοτε κηδεμόνα θα αναγραφετε `εκκρεμεί αποδοχή`. Επιλέγοντας, αυτό θα γίνετε μεταφορά στο συμφωνητικό συνεργασίας, στο οποίο και θα αναγράφονται όλες οι λεπτομέριες συνεργασίας. Τέλος, θα πρέπει να συμπλήρωθουν τα πεδία, ‘Αποδοχή Συμφωνιτικού’ και ‘Αποδοχή Συνεργασίας’, εφοσον υπάρχει συναινεση αναφορικά με την συνεργασία, ενώ σε κάθε αλλη περιπτωση θα πρέπει να επιλεγεί η ‘Απόρριψη Συνεργασίας’.'}/>
          <Accordion title= "Πληρωμή μέσω Voucher" content= {'Όταν ο κηδεμόνας προβεί στην πληρωμή του μηνηαίου ποσού, στο προφιλ σας την κατηγορία των πληρωμών κηδεμόνων θα παρουσιάζεται η πλήρωμή σε εκκρεμότητα και εσεις επιλέγοντας αυτή θα σας εμφανίζεται το Voucher Εξαργύρωση Ποσού Μηνιαίας Πληρωμής, το όποίο εσεις θα καλέιστε να επιβεβαιώσετε ωστε να πληρωθείτε και να απορρίψετε αν κρίνετε οτι έχει γίνει καποιο λάθος ή παρανόηση στην δήλωση των ωρών απο το κηδεμόνά. Στην  περιπτωση της απορριψης, θα πρέπει να μεταβείτε στην συνομιλία σας με τον κηδεμόνα για την επίλυση του προβλήματος και την ολοκλήρωση της πληρωμής σας.'}/></div>
      </main>
      <Footer className={styles.footer} />
    </div>
  );
}